          // Домашнее задание
  // Задача №1


 // Console.WriteLine("Введите первое число  ");
  //int a=Convert.ToInt32(Console.ReadLine());

  //Console.WriteLine("Введите второе число  ");
  //int b=Convert.ToInt32(Console.ReadLine());
   
 //if(a>b)
 //{
   // Console.Write("Максимальное значение = ");
    //Console.WriteLine(a);
    //Console.Write("Минимальное значение = ");
    //Console.Write(b);
 //}
 //else if(a<b)
 //{
   // Console.Write("Максимальное значение = ");
    //Console.WriteLine(b);
    //Console.Write("Минимальное значение = ");
    //Console.Write(a);
 //}
 //else if(a==b)
 //{
   // Console.WriteLine("Значения равны");
 //}




        //Задача №2


 //Console.WriteLine("Введите первое число  ");
  //int a=Convert.ToInt32(Console.ReadLine());

  //Console.WriteLine("Введите второе число  ");
  //int b=Convert.ToInt32(Console.ReadLine());

  //Console.WriteLine("Введите третье число  ");
 // /int c=Convert.ToInt32(Console.ReadLine());
  
  ///int max=0;
 //if(a>max) max = a;
 //if(b>max) max = b;
 //if(c>max) max = c;
 
   // Console.WriteLine(max);
    //Console.Write("Максимальное значение = ");
    //Console.WriteLine(max);
 



       // Задача №3

//Console.WriteLine("Введите число ");
//int a=Convert.ToInt32(Console.ReadLine());

//int i = a%2;

//if(i==1)
//{
//    Console.WriteLine("Не четное");
//} 
//else
//{
//    Console.WriteLine("Четное");
//}


//   Задача №4


//Console.WriteLine("Введите число ");
//int a=Convert.ToInt32(Console.ReadLine());

//int i = 1;
//while (i < a)
//{
   
 //  i= i+1;
   
  //  int k = i%2;
   //if (k == 0)

   //Console.Write(i);
   //Console.Write(" ");

//}

